[
  {
    "id": "39bbb15c-37d2-4969-b784-d3f85180c792",
    "filename": "test.docx",
    "filepath": "/Users/jaelee/Cursor Projects/Lawfully/lawfully-dumbo-chat/server/uploads/1752078275881-test.docx",
    "content": "Lawfully Pro Dumbo\n\nSubscription Types\n\nBasic: $40\n\nPremium: $100\n\nGrowth: $400\n\nEnterprise: Customized Price\n\nSettings Page\n\nOrganization Name update\n\nOrganization Logo update\n\nUser name update\n\nPassword change update\n\nDelete account (Only super admin)\n\nMember invite\n\nMultiple invite at once via email\n\nLawfully Pro has unlimited seat for members.\n\nGeneral Settings\n\nAll members are automatically selected as assignees by default for newly added cases\n\nCompleted cases (Approved, Denied, etc.) are inactivated after 60 days by default\n\nAdding Applicants\n\nName is the only required field\n\nThe rest is optional\n\nAdding Cases\n\nLawfully Pro can track EOIR, USCIS, NVC, DOL cases\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDocument Upload feature (i.e. I-797)\n\nThe 'Document Upload (e.g., I-797)' button is positioned to the left of the 'Bulk Upload' button\n\nWhen users click this button, they will be directed to a page titled 'Upload Documents (i.e. Receipt Notices or I-797s)', which provides functionality for uploading documents\n\nThe maximum number of documents that can be uploaded is limited to 20\n\nHow it works?\n\n New Applicant & New Case: Lawfully Pro will automatically add the applicant and case, extracting relevant information from your documents.\n\n Existing Applicant & New Case: If the applicant already exists in Lawfully Pro but the new case’s document shows a different name, Lawfully Pro will suggest name options based on existing records for you to select. (For example, if Lawfully Pro has \"Jon\" but the new case document shows \"Jonathan\" for the same person, the system will recommend using the original name you entered.\n\nExisting Applicant & Existing Case: If both the applicant and case already exist, Lawfully Pro will retain your previously entered information and update only new or missing data. (For example, if the name in the document differs from the one in Lawfully Pro for the same case number, the system will continue showing the original name you entered.\n\n\n\nScenario 1: New Applicant / New Case\n\nCase Number and Applicant Name will be newly extracted from the documents\n\nScenario 2: Existing Applicant (a scanned applicant’s name closely matches an existing applicant already added in Lawfully Pro) / New Case\n\nCase number will be newly extracted from the documents\n\nWhen a scanned applicant’s name closely matches an existing applicant already in Lawfully Pro, two fields will be displayed for the user:\n\nScanned Name\n\nMatching Name\n\nUsers can select matching name to use or continue using the scanned name, and there will be a message for each situation\n\nScanned name will be used\n\nMatching name will be used\n\nScenario 3: Existing Applicant / Existing Case\n\nSince the case number already exists in the system, all previously saved information will be pre-filled, allowing users to review and update any new or additional details as needed\n\nIf the Nationality field exists, it will display the original scanned country. For example, even if the country was categorized as “Other” in the Visa Bulletin modal, the Nationality field will be pre-filled with the scanned country to avoid showing “Other” to the user.\n\nThe matching name will also be retrieved and automatically selected by default, accompanied by the message: Matching name will be used. To use scanned name, select “use scanned named”.\n\nOnce the Submit button is clicked, all confirmed data will be applied to the user's Lawfully Pro account.\n\n\n\n",
    "uploadTime": "2025-07-09T16:24:35.920Z",
    "fileType": ".docx"
  }
]